In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_excel('titanic.xlsx')
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q
1,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S
2,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q
3,0,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S
4,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S
...,...,...,...,...,...,...,...,...,...
413,0,3,"Spector, Mr. Woolf",male,NaN,0,0,8.0500,S
414,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,108.9000,C
415,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,7.2500,S
416,0,3,"Ware, Mr. Frederick",male,NaN,0,0,8.0500,S
417,0,3,"Peter, Master. Michael J",male,NaN,1,1,22.3583,C

In [11]:
arr=np.array([1,2,3,4,5])
arr.index(2)

AttributeError: 'numpy.ndarray' object has no attribute 'index'

In [4]:
## checking missing value
df.isnull().sum()

Survived     0
Pclass       0
Name         0
Sex          0
Age         86
SibSp        0
Parch        0
Fare         1
Embarked     1
dtype: int64

In [5]:
## filling missing value in age column
df['Age'].fillna(df['Age'].median(),inplace=True)

In [6]:
df['Fare'].fillna(df['Fare'].median(),inplace=True)

In [7]:
df.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    1
dtype: int64

In [8]:
## we have 1 object value missing in embarked column
# find the mode of the categorical data
# use unique count to find
df["Embarked"].value_counts()

S    269
C    102
Q     46
Name: Embarked, dtype: int64

In [9]:
df["Embarked"].fillna("s",inplace=True)

In [10]:
 df["Embarked"].value_counts()

S    269
C    102
Q     46
s      1
Name: Embarked, dtype: int64

In [11]:
## Now we have done mistakes while fillung the missing value,instead of (S) we place
### it with(s). now to convert into uppercase let's see
df["Embarked"]=df["Embarked"].astype(str).str.upper()

In [12]:
 ## Error has been solved
df["Embarked"].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

Q. Check how many people boarded the ship and out of these how many lived and how many died.

In [13]:
df["Survived"].value_counts()

0    266
1    152
Name: Survived, dtype: int64

In [14]:
total=len(df["Survived"])
total

418

In [15]:
### In survived column we have values as 0 & 1 ,i.e., 1 represent survived and 0 as not survived
df["survived_info"]=np.where(df["Survived"]==1,'survived','not survived')

In [16]:
len(df["survived_info"])

418

In [17]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,survived_info
0,0,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q,not survived
1,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S,survived
2,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q,not survived
3,0,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S,not survived
4,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S,survived

In [18]:
live=len(df[df["survived_info"]=='survived'])

In [19]:
live

152

In [20]:
died=len(df[df["survived_info"]=='not survived'])

In [21]:
died

266

In [22]:
print("Total people boarded the ship: ",total)
print("Total people survived: ",live)
print("Total people died: ",died)

Total people boarded the ship:  418
Total people survived:  152
Total people died:  266

In [23]:
## create a pie chart to show % of people died and survived

Q. Find out the number of peolpe lived|died with respect to embarked

In [24]:
sample=df.groupby(["Embarked"]).agg({"Survived":"count"}).reset_index()
sample

  Embarked  Survived
0        C       102
1        Q        46
2        S       270

In [25]:
df.groupby(["Embarked","survived_info"]).agg({"Survived":"count"}).reset_index()

  Embarked survived_info  Survived
0        C  not survived        62
1        C      survived        40
2        Q  not survived        22
3        Q      survived        24
4        S  not survived       182
5        S      survived        88

Q. What is the gender has any significant on survival

In [26]:
df_female=df[df["Sex"]=="female"]
df_male=df[df["Sex"]=="male"]

In [27]:
df_female.shape,df_male.shape

((152, 10), (266, 10))

In [28]:

fs=df_female[df_female["Survived"]==1]
fns=df_female[df_female["Survived"]==0]

In [29]:
print("Female not survived: ",len(fns),"\nFemale survived:",len(fs))

Female not survived:  0
Female survived: 152

In [30]:
## percentage of survived female
per_fs=len(fs)/df_female.shape[0]

In [31]:
per_fs

1.0

In [32]:
per_fns=len(fns)/df_female.shape[0]

In [33]:
per_fns

0.0

In [34]:
ms=df_male[df_male["Survived"]==1]
mns=df_male[df_male["Survived"]==0]

In [35]:
## percentage of survived male
per_ms=len(ms)/df_male.shape[0]

In [36]:
per_ms

0.0

In [37]:
per_mns=len(mns)/df_male.shape[0]

In [38]:
per_mns

1.0

Q. If a passenger is women and she survived and you tell the range (min,max)age
where there is chance of survival.

In [39]:
range_survival=[fs["Age"].min()]
range_survival1=[fs["Age"].max()]

In [40]:
range_survival,range_survival1

([0.17], [76.0])